export const textAfterSubmitClick = {
  positive: {
    thanks: 'Спасибо за твое решение!',
    notification: 'Мы оповестим автора идеи проеĸта о том, что появилось решение.',
    newProjectpropose: 'Чтобы найти или предложить новый проеĸт, выполни ĸоманду /start',
  },
  negative: {
    regret: 'К сожалению, я не могу принять решение, если оно не оформлено по правилам 😢',
    add: 'Добавь то, чего не хватало по чек-листу ☑️ и пробуй снова!',
  },
  buttonText: {
    positive: 'Вернуться к списку проектов',
    negative: 'Попробовать еще раз',
  },
};

export const conditionsList = {
  'Есть публичный git репозиторий': false,
  'Процесс установки описан в README': false,
  'Есть инструкция по использованию приложения в README': false,
};

export const PAGE_TITLE = 'Cдaть задачу';
export const NO = 'Нет';
export const YES = 'Да';
export const GOOD = 'Отлично';
export const IS_ALL_READY = 'Давай сверимся, все ли готово для сдачи решения';

export const CANSEL = 'Отмена';
export const SUBMITING = 'Сдать проект';
export const REF = 'Ссылка';
export const VALID_REF = 'Введите ссылку на github';
export const INVALID_REF = 'Некорректаная ссылка, проверьте правильность введения ссылки';

export const PAGE_TITLE_GIT = 'Отправь нам ссылку на репозиторий';
export const BACK = 'Назад';
export const FATHER = 'Далее';
